---
type: KeynoteEntry
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# KeynoteEntry

`Autodesk.Revit.DB.KeynoteEntry` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | KeynoteEntry | — | `` |
| Property | KeynoteText | 2015 | `public string KeynoteText { get ; }` |